app/views/laba10/output.html.erb

</br> <%= link_to "Data base in xml form", "/allxml" %>
<% if Model.count > 1 && Model.first[:id] == 1 %>
  </br> <%= link_to "Previous value", "/laba10/output?v1=#{Model.find(Model.count - 1)[:num]}" %>
---
SELECT  "models".* FROM "models" ORDER BY "models"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "models"
SELECT  "models".* FROM "models" WHERE "models"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]