app/controllers/laba10_controller.rb

  def allinxml
    code = []
    1.upto(Model.count) { |i| code.push(JSON.parse(Model.find(i)[:result])) }
---
SELECT  "models".* FROM "models" WHERE "models"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def output
    @v1 = params[:v1]
    if !(@v1 =~ /\A[-+]?[0-9]*\.?[0-9]+\Z/).nil?
      if Model.find_by(num: @v1).nil?
        @result = root(@v1)
        Model.create(num: @v1, result: @result.map { |x| { elem: x } }.to_json)
      else
        arr = JSON.parse(Model.find_by(num: @v1)[:result])
        @result = arr.flat_map { |x| x.values }
        @mean = @result[@result.size - 1]
---
SELECT  "models".* FROM "models" WHERE "models"."num" = ? LIMIT ?  [["num", "4"], ["LIMIT", 1]]
SELECT  "models".* FROM "models" WHERE "models"."num" = ? LIMIT ?  [["num", "65"], ["LIMIT", 1]]
INSERT INTO "models" ("num", "result", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["num", "13"], ["result", "[{\"elem\":4.25},{\"elem\":3.6544117647058822},{\"elem\":3.6058779145461}]"], ["created_at", "2018-12-22 14:30:00.071632"], ["updated_at", "2018-12-22 14:30:00.071632"]]
SELECT COUNT(*) FROM "models"